src/InformationRegisters/ar_Запуски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_Запуски</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_СтатусЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ОтветLLM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АгентРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтартовалВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершенВ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_Триггер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПользовательРеф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ТокеновВыход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СтоимостьРуб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ШаговВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_РодительскийRunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_StateSnapshot</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_LastHeartbeat</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ПрофильЗапуска</Name>
					<Comment>Профиль запуска (CONS-01), определивший ответственного и область данных этого запуска. Пустая ссылка — профиль не указан (обратная совместимость, CONS-02).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_ПрофилиЗапуска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_RunId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ar_СтатусЗапуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_СтатусЗапуска</Name>
			<Comment>Жизненный цикл запуска агента: created -&gt; running -&gt; paused/completed/failed/...</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Created</Name>
					<Comment>Запись создана, фоновое задание ещё не стартовало</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Running</Name>
					<Comment>Фоновое задание активно, loop работает</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForApproval</Name>
					<Comment>Loop приостановлен, ждёт решения оператора в очереди подтверждений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForInput</Name>
					<Comment>Loop приостановлен, агент ожидает ответа оператора на вопрос ask_user</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Completed</Name>
					<Comment>Финальный статус: агент выполнил задачу без ошибок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
					<Comment>Финальный статус: необработанное исключение или сбой LLM</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
					<Comment>Финальный статус: отменён пользователем вручную</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>MaxStepsReached</Name>
					<Comment>Финальный статус: превышен МаксШагов агента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeniedGlobally</Name>
					<Comment>Финальный статус: пользователь не входит в роль агента</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Interrupted</Name>
					<Comment>Финальный статус: heartbeat пропал дольше порога, сервер упал</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FailedIncompatibleState</Name>
					<Comment>Финальный статус: StateSnapshot несовместим с текущей версией ядра</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PausedForEvent</Name>
					<Comment>PLAN-10: Loop приостановлен, ждёт наступления внешнего события (tool wait_for_event, PLAN-11) или истечения дедлайна ar_ОжиданиеДо (PLAN-13). Снимается ar_ОбработчикПодписок (push, PLAN-12) или регламентным заданием проверки дедлайна (PLAN-13).</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ar_RuntimeЗапуск/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2026, Александр Барабанов
//
// AgentRunner для 1С — свободное программное обеспечение: вы можете
// распространять и/или изменять его на условиях GNU Affero General Public
// License версии 3, опубликованной Free Software Foundation.
//
// Программа распространяется в надежде, что она будет полезной, но БЕЗ
// КАКИХ-ЛИБО ГАРАНТИЙ. Подробности — в файле LICENSE в корне репозитория
// и по ссылке: https://www.gnu.org/licenses/agpl-3.0.html
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_RuntimeЗапуск (Запуск агентов - Runtime).
//
// Единственная санкционированная точка входа для запуска агентного цикла в
// фоновом задании. Любой запуск агента - интерактивный (UI), плановый (cron),
// по webhook/mention или resume после approval - обязан проходить через этот
// модуль (Plan §3.1, RT-02 / RT-03).
//
// Модуль намеренно тонкий: он НЕ содержит логики цикла (она в ar_RuntimeЦикл,
// RT-06), логики permission/approval (RT-10, PERM-01, APPR-01). Это «порог»,
// за которым открывается фоновый контекст.
//
// Свойства модуля: Сервер, НеГлобальный, Привилегированный = Ложь. Привилегированный
// режим здесь не нужен - запись audit идёт через привилегированный модуль
// ar_AuditЗапуски (у него Privileged=true в манифесте).
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Стартовать агентный цикл в фоновом задании.
//
// Генерирует RunId, фиксирует начальную запись в регистре ar_Запуски через
// ar_AuditЗапуски.Создать и ставит фоновое задание ar_RuntimeЦикл.ВыполнитьАгента
// с ключом дедупликации "ar_run_"+RunId.
//
// Параметры:
//  СсылкаАгент      - СправочникСсылка.ar_Агенты - запускаемый агент. Не может
//                     быть пустой ссылкой; агент должен быть активен (ar_Активен).
//  КонтекстТриггера - Структура - описание триггера запуска:
//                      * Триггер              - Строка - "manual"/"cron"/"webhook"/
//                                               "mention"/"approval_resume". Обязателен.
//                      * ПользовательРеф      - СправочникСсылка.Пользователи - инициатор.
//                                               Если не задан - Пользователи.ТекущийПользователь().
//                      * РодительскийRunId    - Строка(36) - для дочерних запусков. Опционально.
//                      * ДополнительныеПараметры - Соответствие - данные для цикла. Опционально.
//
// Возвращаемое значение:
//  Структура - результат запуска:
//   * Успех   - Булево - Истина при успешной постановке задания.
//   * RunId   - Строка(36) - идентификатор созданного запуска.
//   * Причина - Строка - при Успех=Ложь - машиночитаемая причина отказа.
//
Функция СтартоватьВФоне(СсылкаАгент, КонтекстТриггера) Экспорт

	Результат = НовыйРезультат();

	// Проверка агента выполняется до создания RunId и записи audit.
	// Одним запросом получаем и признак активности, и наименование (без
	// «ленивой» загрузки объекта целиком - std487).
	ДанныеАгента = ДанныеАгента(СсылкаАгент);
	Если ДанныеАгента = Неопределено Тогда
		Результат.Причина = "agent_not_found_or_inactive";
		Возврат Результат;
	КонецЕсли;

	// Guard дедупликации: проверяем, не запущен ли уже ТОТ ЖЕ агент.
	// RunId генерируется ниже как свежий UUID - проверять его не имеет смысла.
	// Реальный дубль - повторный запуск агента, пока предыдущий ещё активен.
	Если АгентЗапущен(СсылкаАгент) Тогда
		Результат.Причина = "agent_already_running";
		Возврат Результат;
	КонецЕсли;

	RunId = ar_Утилиты.НовыйUUID();

	ПользовательРеф = ОпределитьПользователя(КонтекстТриггера);
	Триггер = ?(КонтекстТриггера.Свойство("Триггер"), КонтекстТриггера.Триггер, "manual");
	РодительскийRunId = "";
	КонтекстТриггера.Свойство("РодительскийRunId", РодительскийRunId);

	ДанныеСоздания = Новый Структура;
	ДанныеСоздания.Вставить("АгентРеф", СсылкаАгент);
	ДанныеСоздания.Вставить("Триггер", Триггер);
	ДанныеСоздания.Вставить("ПользовательРеф", ПользовательРеф);
	ДанныеСоздания.Вставить("Статус", Перечисления.ar_СтатусЗапуска.Created);
	ДанныеСоздания.Вставить("СтартовалВ", ТекущаяДатаСеанса());
	Если ЗначениеЗаполнено(РодительскийRunId) Тогда
		ДанныеСоздания.Вставить("РодительскийRunId", РодительскийRunId);
	КонецЕсли;

	// CONS-02: профиль запуска. Резолвится только по КонтекстТриггера.РутинаРеф
	// (cron/mention уже прокидывают эту ссылку - ar_Scheduler.ЗапуститьАгента/
	// ЗапуститьАгентаПоУпоминанию). Единственная точка резолва - здесь, а не
	// в ar_Scheduler, чтобы не дублировать знание формата ДанныеСоздания
	// (спека CONS-02, «Рекомендуемые скиллы»). Ошибка резолва не должна
	// прерывать запуск - ПрофильЗапускаИзРутины сама глотает исключения.
	// Отсутствие РутинаРеф (manual/HTTP/подписки без рутины) - профиль не
	// заполняется вовсе, ДанныеСоздания.ПрофильЗапуска не добавляется - битово
	// то же поведение, что и до CONS-02 (обратная совместимость, решение 22).
	ПрофильЗапуска = ПрофильЗапускаИзРутины(КонтекстТриггера);
	Если ЗначениеЗаполнено(ПрофильЗапуска) Тогда
		ДанныеСоздания.Вставить("ПрофильЗапуска", ПрофильЗапуска);
		// Прокидываем в тот же КонтекстТриггера, который дальше передаётся в
		// ar_RuntimeЦикл.ВыполнитьАгента (см. ЗапуститьВФоне) - по образцу
		// ИнструкцияДобавка (ROUT-04): рантайм строит факт области данных из
		// профиля, не читая регистр ar_Запуски повторно.
		КонтекстТриггера.Вставить("ПрофильЗапуска", ПрофильЗапуска);
	КонецЕсли;

	Возврат ЗапуститьВФоне(
		СсылкаАгент,
		RunId,
		ДанныеСоздания,
		НаименованиеЗадания(ДанныеАгента.Наименование, RunId),
		КонтекстТриггера,
		НСтр("ru='ar_RuntimeЗапуск.СтартоватьВФоне: не удалось прервать запись';
		|en='ar_RuntimeЗапуск.StartInBackground: failed to interrupt record'"),
		Результат);

КонецФункции

// Возобновить ранее приостановленный запуск.
//
// UI-13: помимо approved-/rejected-возобновления PausedForApproval-запусков
// (вызывается из ar_Approval, APPR-02 / APPR-03), функция также принимает
// запуски в статусе Interrupted (ручной resume, UI-13) и PausedForInput
// (возобновление после ответа оператора на ask_user, TOOL-19 D9). Guard
// расширен строго аддитивно (Plan §3.1):
//  * PausedForApproval - Триггер = "approval_resume".
//  * Interrupted       - Триггер = "manual_resume".
//  * PausedForInput    - Триггер = "input_resume" (TOOL-19 D9).
//  * Любой другой      - unexpected_status.
//
// Параметры:
//  RunId               - Строка(36)  - идентификатор возобновляемого запуска.
//  КонтекстОтклонения  - Структура, Массив - наблюдение(я) о решении оператора
//                        по завершённому approval (approve или reject, имя
//                        параметра исторически от APPR-03):
//                        * Структура {ToolCallId, ТекстObservation} - один
//                          approval (одиночный approve/reject).
//                        * Массив таких структур - несколько approval с одного
//                          шага модели (массовый approve, UI-31/APPR-05) -
//                          по одному tool-результату на каждый tool_call_id,
//                          в одну строку они склеены быть не могут (протокол
//                          требует ровно один результат на каждый вызов).
//                        Дефолт Неопределено.
//  ТриггерПереопределен - Строка     - если задан явно, переопределяет авто-выбор
//                        триггера. Используется ВозобновитьОтвеченное ("input_resume").
//  ДопКонтекст         - Структура   - дополнительные ключи для КонтекстТриггера
//                        (например, approval_id + user_answer для ask_user).
//
// Возвращаемое значение:
//  Структура - {Успех: Булево, RunId: Строка, Причина: Строка}.
//
Функция Возобновить(RunId, КонтекстОтклонения = Неопределено,
		ТриггерПереопределен = "", ДопКонтекст = Неопределено) Экспорт

	Результат = НовыйРезультат();
	Результат.RunId = RunId;

	Попытка

		// UI-31/APPR-05: блокировка на RunId сериализует конкурентные попытки
		// возобновить один и тот же запуск - планировщик SCHED-03 (раз в минуту,
		// ar_Scheduler.ВозобновитьОдобренное) и массовый approve из чата
		// (ApproveВсеНаСервере) оба идут через эту функцию. Без блокировки оба
		// могли одновременно пройти guard'ы (МенеджерЗаписи.Прочитать +
		// НайтиАктивноеЗадание не атомарны сами по себе), и SCHED-03 мог
		// возобновить запуск по первой approved-записи пакета БЕЗ наблюдений
		// раньше, чем массовый approve соберёт и передаст их все - второй вызов
		// получал бы already_running и тихо терял наблюдения остальных карточек.
		// Транзакция короткая - охватывает только guard-проверки (единственный
		// коммит в конце блока, ранних Возврат внутри транзакции нет - std/BSL LS
		// требует ЗафиксироватьТранзакцию последней инструкцией перед Исключение),
		// не сам запуск фонового задания (ФоновыеЗадания.Выполнить вне транзакции).
		МожноВозобновить = Ложь;
		НачатьТранзакцию();
		Попытка

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ar_Запуски");
			ЭлементБлокировки.УстановитьЗначение("ar_RunId", RunId);
			Блокировка.Заблокировать();

			МенеджерЗаписи = РегистрыСведений.ar_Запуски.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ar_RunId = RunId;
			МенеджерЗаписи.Прочитать();

			Если Не МенеджерЗаписи.Выбран() Тогда
				Результат.Причина = "run_not_found";
			Иначе
				// Guard: допустимые статусы для возобновления.
				РазрешенныеСтатусы = (МенеджерЗаписи.ar_Статус
						= Перечисления.ar_СтатусЗапуска.PausedForApproval)
					Или (МенеджерЗаписи.ar_Статус
						= Перечисления.ar_СтатусЗапуска.Interrupted)
					Или (МенеджерЗаписи.ar_Статус
						= Перечисления.ar_СтатусЗапуска.PausedForInput);

				Если Не РазрешенныеСтатусы Тогда
					Результат.Причина = "unexpected_status: " + Строка(МенеджерЗаписи.ar_Статус);
				ИначеЕсли НайтиАктивноеЗадание(RunId) <> Неопределено Тогда
					Результат.Причина = "already_running";
				Иначе
					МожноВозобновить = Истина;
				КонецЕсли;
			КонецЕсли;

			ЗафиксироватьТранзакцию();

		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;

		Если Не МожноВозобновить Тогда
			Возврат Результат;
		КонецЕсли;

		Снимок = ar_AuditЗапуски.ПрочитатьСнимок(RunId);
		Если Снимок = Неопределено Тогда
			Результат.Причина = "snapshot_missing_or_incompatible";
			Возврат Результат;
		КонецЕсли;

		// Определить имя триггера.
		Если Не ПустаяСтрока(ТриггерПереопределен) Тогда
			ИмяТриггера = ТриггерПереопределен;
		ИначеЕсли МенеджерЗаписи.ar_Статус
				= Перечисления.ar_СтатусЗапуска.Interrupted Тогда
			ИмяТриггера = "manual_resume";
		ИначеЕсли МенеджерЗаписи.ar_Статус
				= Перечисления.ar_СтатусЗапуска.PausedForInput Тогда
			ИмяТриггера = "input_resume";
		Иначе
			ИмяТриггера = "approval_resume";
		КонецЕсли;

		КонтекстТриггера = Новый Структура;
		КонтекстТриггера.Вставить("Триггер", ИмяТриггера);
		КонтекстТриггера.Вставить("Снимок",  Снимок);

		// TD-02 (итерация 2): КонтекстТриггера на resume строится заново и не
		// содержит признак «без агента» - без него ar_RuntimeЦикл.ВыполнитьАгентаВнутр
		// трактует любой resume как агентный (БезАгента=Ложь по умолчанию) и падает
		// в agent_not_found_or_inactive для sentinel-запусков без реального ar_Агенты
		// (см. td-02.md, Ревью 1 (BLOCKED), находка (b)). Донор данных - Состояние,
		// сохранённое в снимке (ar_Scheduler.СформироватьСостояниеДляSentinel кладёт
		// туда БезАгента/ОверрайдПровайдер/ОверрайдTools как примитивы - ссылочные
		// типы в state запрещены, ar_AuditЗапуски.ПроверитьСериализуемость). Правка
		// строго аддитивна: при отсутствии ключей в снимке (обычный агентный запуск,
		// живой ReAct-цикл) КонтекстТриггера.БезАгента не добавляется вовсе и
		// поведение не отличается от текущего.
		ДополнитьКонтекстТриггераИзСнимкаБезАгента(КонтекстТриггера, Снимок);

		// APPR-03: resume после отклонения несёт rejection-observation.
		Если ТипЗнч(КонтекстОтклонения) = Тип("Структура") Тогда
			КонтекстТриггера.Вставить("RejectionObservation", КонтекстОтклонения);
		// UI-31/APPR-05: массовый approve (несколько tool_call на одном шаге,
		// см. ApproveВсеНаСервере) несёт по одному observation на каждый
		// approval_id - модель ждёт ровно один tool-результат на каждый её
		// tool_call_id, "склеить" их в одну строку было бы протокольно неверно.
		ИначеЕсли ТипЗнч(КонтекстОтклонения) = Тип("Массив") Тогда
			КонтекстТриггера.Вставить("RejectionObservations", КонтекстОтклонения);
		КонецЕсли;

		// TOOL-19: resume после ответа оператора несёт user_answer и approval_id.
		ДополнитьКонтекстТриггераИзДопКонтекста(КонтекстТриггера, ДопКонтекст);

		АгентРеф = МенеджерЗаписи.ar_АгентРеф;
		НаименованиеАгентаТекст = НаименованиеАгента(АгентРеф);

		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(АгентРеф);
		МассивПараметров.Добавить(RunId);
		МассивПараметров.Добавить(КонтекстТриггера);

		ФоновыеЗадания.Выполнить(
			"ar_RuntimeЦикл.ВыполнитьАгента",
			МассивПараметров,
			КлючЗадания(RunId),
			НаименованиеЗадания(НаименованиеАгентаТекст, RunId));

		Результат.Успех = Истина;
		Возврат Результат;

	Исключение
		Результат.Причина = ar_Утилиты.ОчиститьОшибкуДляLLM(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Результат;
	КонецПопытки;

КонецФункции

// Отменить запуск: остановить активное фоновое задание (если есть) и пометить
// запись в регистре прерванной. Используется UI («Отменить запуск») и внутренней
// логикой.
//
// Параметры:
//  RunId - Строка(36) - идентификатор отменяемого запуска.
//
// Возвращаемое значение:
//  Булево - Истина, если активное фоновое задание было найдено и отменено;
//           Ложь, если активного задания нет (запуск уже завершён).
//
Функция Отменить(RunId) Экспорт

	НайденоАктивное = Ложь;

	Попытка

		ФоновоеЗадание = НайтиАктивноеЗадание(RunId);
		Если ФоновоеЗадание <> Неопределено Тогда
			НайденоАктивное = Истина;
			Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				ФоновоеЗадание.Отменить();
			КонецЕсли;
		КонецЕсли;

		// Статус в регистре переводим немедленно; платформа не гарантирует
		// мгновенную остановку задания - цикл сам обязан проверять статус (RT-06).
		Если НайденоАктивное Тогда
			ar_AuditЗащищённыйРежим.ЗаписатьСтатусЗапускаПривилегированно(RunId, "Прервать");
		КонецЕсли;

	Исключение
		ТекстОш = ar_Утилиты.ОчиститьОшибкуДляLLM(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_RuntimeЗапуск.Отменить'; en = 'ar_RuntimeЗапуск.Cancel'"),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ar_Запуски,
			,
			ТекстОш);
	КонецПопытки;

	Возврат НайденоАктивное;

КонецФункции

// Стартовать анонимный (без агента) цикл в фоновом задании (UI-22).
//
// Используется из формы ar_Диалог в режиме «без агента»: пользователь
// явно выбирает набор tools и провайдера, не создавая запись в ar_Агенты.
//
// Параметры:
//  КонтекстТриггера - Структура - обязательные ключи:
//   * БезАгента          - Булево - Истина (маркер режима).
//   * ОверрайдTools      - Массив - строки с именами tools.
//   * ОверрайдПровайдер  - СправочникСсылка.ar_LLMПровайдеры.
//   * ЗапросПользователя - Строка - первый запрос пользователя.
//   * Триггер            - Строка - "manual_chat_no_agent".
//
// Возвращаемое значение:
//  Структура - {Успех: Булево, RunId: Строка, Причина: Строка}.
//
Функция СтартоватьВФонеБезАгента(КонтекстТриггера) Экспорт

	// Анонимный запуск не привязан к справочнику ar_Агенты.
	// Используем пустую ссылку; ar_RuntimeЦикл обработает БезАгента=Истина.
	АгентРеф = Справочники.ar_Агенты.ПустаяСсылка();
	RunId    = ar_Утилиты.НовыйUUID();

	ПользовательРеф = ОпределитьПользователя(КонтекстТриггера);

	ДанныеСоздания = Новый Структура;
	ДанныеСоздания.Вставить("АгентРеф",       АгентРеф);
	ДанныеСоздания.Вставить("Триггер",         ТриггерБезАгента());
	ДанныеСоздания.Вставить("ПользовательРеф", ПользовательРеф);
	ДанныеСоздания.Вставить("Статус",          Перечисления.ar_СтатусЗапуска.Created);
	ДанныеСоздания.Вставить("СтартовалВ",      ТекущаяДатаСеанса());

	НаименованиеЗад = НСтр("ru='AgentRunner (без агента) #'; en='AgentRunner (no-agent) #'") + RunId;

	Результат = НовыйРезультат();
	Возврат ЗапуститьВФоне(
		АгентРеф,
		RunId,
		ДанныеСоздания,
		НаименованиеЗад,
		КонтекстТриггера,
		НСтр("ru='ar_RuntimeЗапуск.СтартоватьВФонеБезАгента';
		|en='ar_RuntimeЗапуск.StartInBackgroundNoAgent'"),
		Результат);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Общая логика постановки фонового задания: создание audit-записи и запуск
// ar_RuntimeЦикл.ВыполнитьАгента. Используется из СтартоватьВФоне и
// СтартоватьВФонеБезАгента. При исключении пытается прервать уже созданную запись.
//
// В файловой ИБ разрешено не более одного одновременно активного фонового
// задания (платформенное ограничение) - при достижении лимита выполняем
// синхронно вместо постановки в очередь, по паттерну БСП
// [Реф: БСП/CommonModules/ДлительныеОперации.ЗапуститьВыполнениеВФоне].
// В клиент-серверном режиме лимита нет - всегда ставим в фоновое задание.
//
// Параметры:
//  АгентРеф          - СправочникСсылка.ar_Агенты - ссылка (может быть пустой).
//  RunId             - Строка(36) - идентификатор запуска.
//  ДанныеСоздания    - Структура - набор ключей для ar_AuditЗапуски.Создать.
//  НаименованиеЗад   - Строка - текст для системного списка заданий.
//  КонтекстТриггера  - Структура - передаётся как параметр в ar_RuntimeЦикл.
//  ТекстЛогПрерв     - Строка - НСтр-текст для журнала при ошибке прерывания.
//  Результат         - Структура - заготовка {Успех, RunId, Причина} (изменяется).
//
// Возвращаемое значение:
//  Структура - {Успех, RunId, Причина}.
//
Функция ЗапуститьВФоне(АгентРеф, RunId, ДанныеСоздания, НаименованиеЗад,
		КонтекстТриггера, ТекстЛогПрерв, Результат)

	ЗаписьСоздана = Ложь;

	Попытка

		// Нет audit - нет запуска: создаём запись до постановки задания.
		ar_AuditЗащищённыйРежим.СоздатьЗапускПривилегированно(RunId, ДанныеСоздания);
		ЗаписьСоздана = Истина;

		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(АгентРеф);
		МассивПараметров.Добавить(RunId);
		МассивПараметров.Добавить(КонтекстТриггера);

		Если ФоновоеЗаданиеНужноВыполнитьСинхронно() Тогда
			// Статический вызов вместо ОбщегоНазначения.ВыполнитьМетодКонфигурации:
			// та БСП-функция строит вызов через Выполнить() по имени модуля,
			// что оказалось источником сбоев для кода расширений (диагностика
			// UI-22). Модуль и сигнатура известны заранее - динамика не нужна.
			ar_RuntimeЦикл.ВыполнитьАгента(АгентРеф, RunId, КонтекстТриггера);
		Иначе
			ФоновыеЗадания.Выполнить(
				"ar_RuntimeЦикл.ВыполнитьАгента",
				МассивПараметров,
				КлючЗадания(RunId),
				НаименованиеЗад);
		КонецЕсли;

		Результат.Успех = Истина;
		Результат.RunId = RunId;
		Возврат Результат;

	Исключение

		ИнформацияОбОшибке = ИнформацияОбОшибке();
		// Запись создана, но задание не стартовало - помечаем как прерванный.
		Если ЗаписьСоздана Тогда
			Попытка
				ar_AuditЗащищённыйРежим.ЗаписатьСтатусЗапускаПривилегированно(RunId, "Прервать");
			Исключение
				// Вторичная ошибка при прерывании записи - логируем,
				// чтобы не скрыть основное исключение.
				ТекстВторичнойОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации(
					ТекстЛогПрерв,
					УровеньЖурналаРегистрации.Предупреждение,
					Метаданные.РегистрыСведений.ar_Запуски, ,
					ТекстВторичнойОшибки);
			КонецПопытки;
		КонецЕсли;

		Результат.Причина = ПричинаПоИсключению(ИнформацияОбОшибке, ЗаписьСоздана);
		Возврат Результат;

	КонецПопытки;

КонецФункции

// Строковая константа триггера для анонимного запуска (без агента).
// Вынесена в функцию для единой точки изменения.
//
// Возвращаемое значение:
//  Строка.
//
Функция ТриггерБезАгента()
	Возврат "manual_chat_no_agent";
КонецФункции

// Определяет, нужно ли выполнить агентный цикл синхронно вместо постановки
// в фоновое задание. Платформа допускает в файловой ИБ не более одного
// одновременно активного фонового задания - при превышении лимита
// ФоновыеЗадания.Выполнить бросает исключение. Чтобы не полагаться на разбор
// текста ошибки постфактум, проверяем количество активных заданий заранее,
// по паттерну БСП [Реф: БСП/CommonModules/ДлительныеОперации.ЗапуститьВыполнениеВФоне].
// В клиент-серверном режиме лимита нет - функция всегда возвращает Ложь.
//
// Возвращаемое значение:
//  Булево - Истина, если нужно выполнить синхронно (лимит уже занят).
//
Функция ФоновоеЗаданиеНужноВыполнитьСинхронно()

	Если НЕ ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		Возврат Ложь;
	КонецЕсли;

	Отбор = Новый Структура("Состояние", СостояниеФоновогоЗадания.Активно);
	Возврат ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор).Количество() > 0;

КонецФункции

// Проверить наличие активного фонового задания для данного агента.
// Используется для дедупликации в СтартоватьВФоне: защита от повторного запуска
// того же агента, пока предыдущий ещё выполняется.
// Для режима «без агента» (СтартоватьВФонеБезАгента) не применяется, так как
// пустая ссылка не является уникальным идентификатором агента.
//
// Параметры:
//  СсылкаАгент - СправочникСсылка.ar_Агенты - ссылка на агента.
//
// Возвращаемое значение:
//  Булево - Истина, если агент уже выполняется в фоновом задании.
//
Функция АгентЗапущен(СсылкаАгент)

	// Признак берётся из регистра ar_Запуски, а не перебором фоновых заданий.
	// Прежний код доставал агента из параметров задания: сначала через
	// Задание.ПолучитьПараметры() ("Object method not found"), затем через
	// Задание.Параметры ("Object field not found") - у ФоновогоЗадания нет
	// ни того, ни другого (Параметры есть у РегламентногоЗадания, отсюда и
	// путаница). Из-за этого guard дедупликации падал на каждом тике и агент
	// вообще не стартовал. ПодсчитатьАктивныеЗапуски считает ровно активные
	// (Running) запуски этого агента - то, что и требуется guard-у.
	Счётчики = ar_AuditЗащищённыйРежим.ПодсчитатьАктивныеЗапускиПривилегированно(СсылкаАгент);

	Возврат Счётчики.ПоАгенту > 0;

КонецФункции

// Получить данные активного агента одним запросом (без «ленивой» загрузки
// объекта целиком - std487). Возвращает данные только если агент существует
// и активен.
//
// Параметры:
//  СсылкаАгент - СправочникСсылка.ar_Агенты.
//
// Возвращаемое значение:
//  Структура - {Наименование: Строка} если агент существует и активен;
//  Неопределено - если ссылка пустая/некорректного типа, агент не найден
//                 или не активен.
//
Функция ДанныеАгента(СсылкаАгент)

	Если СсылкаАгент = Неопределено Или Не ЗначениеЗаполнено(СсылкаАгент) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если ТипЗнч(СсылкаАгент) <> Тип("СправочникСсылка.ar_Агенты") Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Агенты.Наименование КАК Наименование,
		|	Агенты.ar_Активен КАК Активен
		|ИЗ
		|	Справочник.ar_Агенты КАК Агенты
		|ГДЕ
		|	Агенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаАгент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Выборка.Активен <> Истина Тогда
		Возврат Неопределено;
	КонецЕсли;

	Данные = Новый Структура;
	Данные.Вставить("Наименование", Выборка.Наименование);
	Возврат Данные;

КонецФункции

// Получить наименование агента по ссылке одним запросом (без «ленивой»
// загрузки объекта - std487). Используется при возобновлении, когда признак
// активности уже не важен.
//
// Параметры:
//  СсылкаАгент - СправочникСсылка.ar_Агенты.
//
// Возвращаемое значение:
//  Строка - наименование агента (пустая строка, если не найден).
//
Функция НаименованиеАгента(СсылкаАгент)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Агенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ar_Агенты КАК Агенты
		|ГДЕ
		|	Агенты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаАгент);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Наименование;
	КонецЕсли;

	Возврат "";

КонецФункции

// CONS-02: читает профиль запуска рутины, указанной в КонтекстТриггера.РутинаРеф.
// Возвращает пустую ссылку (не заполняет ДанныеСоздания), если рутина не
// передана, у рутины нет профиля, либо чтение упало с ошибкой - в точности
// то же поведение, что и до CONS-02 (обратная совместимость, решение 22).
// Ошибка логируется, но не прерывает запуск (по аналогии с
// ar_RuntimeКонтекст.ЗагрузитьБлокПамяти - "вспомогательная секция").
//
// Параметры:
//  КонтекстТриггера - Структура, Неопределено - см. СтартоватьВФоне; ключ
//                     РутинаРеф - СправочникСсылка.ar_Рутины, опционален.
//
// Возвращаемое значение:
//  СправочникСсылка.ar_ПрофилиЗапуска - профиль рутины; пустая ссылка, если
//  рутина не передана, профиль не задан или произошла ошибка чтения.
//
Функция ПрофильЗапускаИзРутины(Знач КонтекстТриггера)

	ПустойПрофиль = Справочники.ar_ПрофилиЗапуска.ПустаяСсылка();

	Если ТипЗнч(КонтекстТриггера) <> Тип("Структура") Тогда
		Возврат ПустойПрофиль;
	КонецЕсли;

	РутинаРеф = Неопределено;
	Если Не КонтекстТриггера.Свойство("РутинаРеф", РутинаРеф)
		Или Не ЗначениеЗаполнено(РутинаРеф) Тогда
		Возврат ПустойПрофиль;
	КонецЕсли;

	Если ТипЗнч(РутинаРеф) <> Тип("СправочникСсылка.ar_Рутины") Тогда
		Возврат ПустойПрофиль;
	КонецЕсли;

	Попытка

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Рутина", РутинаРеф);
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Рутины.ar_ПрофильЗапуска КАК ПрофильЗапуска
			|ИЗ
			|	Справочник.ar_Рутины КАК Рутины
			|ГДЕ
			|	Рутины.Ссылка = &Рутина";

		Выборка = Запрос.Выполнить().Выбрать();
		Если Не Выборка.Следующий() Тогда
			Возврат ПустойПрофиль;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Выборка.ПрофильЗапуска) Тогда
			Возврат ПустойПрофиль;
		КонецЕсли;

		Возврат Выборка.ПрофильЗапуска;

	Исключение
		ТекстОш = ar_Утилиты.ОчиститьОшибкуДляLLM(
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_RuntimeЗапуск.ПрофильЗапускаИзРутины'; en = 'ar_RuntimeЗапуск.RunProfileFromRoutine'"),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ar_Рутины,
			,
			ТекстОш);
		Возврат ПустойПрофиль;
	КонецПопытки;

КонецФункции

// Определить пользователя-инициатора запуска.
//
// Параметры:
//  КонтекстТриггера - Структура.
//
// Возвращаемое значение:
//  СправочникСсылка.Пользователи - явно переданный пользователь либо текущий.
//
Функция ОпределитьПользователя(КонтекстТриггера)

	ПользовательРеф = Неопределено;
	Если КонтекстТриггера.Свойство("ПользовательРеф", ПользовательРеф)
		И ЗначениеЗаполнено(ПользовательРеф) Тогда
		Возврат ПользовательРеф;
	КонецЕсли;

	Возврат Пользователи.ТекущийПользователь();

КонецФункции

// Найти активное фоновое задание по ключу дедупликации запуска.
//
// Параметры:
//  RunId - Строка(36).
//
// Возвращаемое значение:
//  ФоновоеЗадание - найденное активное задание; Неопределено, если нет.
//
Функция НайтиАктивноеЗадание(RunId)

	Отбор = Новый Структура;
	Отбор.Вставить("Ключ", КлючЗадания(RunId));

	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Для Каждого Задание Из Задания Цикл
		Если Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			Возврат Задание;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

// Ключ дедупликации фонового задания для запуска.
//
// Параметры:
//  RunId - Строка(36).
//
// Возвращаемое значение:
//  Строка - ключ вида "ar_run_<RunId>".
//
Функция КлючЗадания(RunId)
	Возврат "ar_run_" + RunId;
КонецФункции

// Наименование фонового задания (для системного списка заданий).
//
// Параметры:
//  НаименованиеАгента - Строка - наименование агента.
//  RunId              - Строка(36).
//
// Возвращаемое значение:
//  Строка.
//
Функция НаименованиеЗадания(НаименованиеАгента, RunId)
	Возврат СтрШаблон(
		НСтр("ru = 'Agent: %1 run %2'; en = 'Agent: %1 run %2'"),
		НаименованиеАгента,
		RunId);
КонецФункции

// Сопоставить исключение с машиночитаемой причиной отказа.
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке.
//  ЗаписьСоздана      - Булево - была ли уже создана запись audit.
//
// Возвращаемое значение:
//  Строка - машиночитаемая причина отказа.
//
Функция ПричинаПоИсключению(ИнформацияОбОшибке, ЗаписьСоздана)

	ОчищенныйТекст = ar_Утилиты.ОчиститьОшибкуДляLLM(
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

	// Audit не записан - значит упал ar_AuditЗапуски.Создать.
	Если Не ЗаписьСоздана Тогда
		Возврат "audit_create_failed: " + ОчищенныйТекст;
	КонецЕсли;

	ТекстОшибки = НРег(ОчищенныйТекст);
	Если СтрНайти(ТекстОшибки, "фоновое") > 0
		Или СтрНайти(ТекстОшибки, "background") > 0
		Или СтрНайти(ТекстОшибки, "файлов") > 0 Тогда
		Возврат "background_jobs_unavailable";
	КонецЕсли;

	Если СтрНайти(ТекстОшибки, "ключ") > 0 Или СтрНайти(ТекстОшибки, "key") > 0 Тогда
		Возврат КодПричиныДублирование();
	КонецЕсли;

	Возврат "background_jobs_unavailable: " + ОчищенныйТекст;

КонецФункции

// Машиночитаемый код причины: попытка запустить задание с уже занятым ключом.
//
// Возвращаемое значение:
//  Строка.
//
Функция КодПричиныДублирование()
	Возврат "duplicate_run";
КонецФункции

// Заготовка результата экспортных функций.
//
// Возвращаемое значение:
//  Структура - {Успех: Ложь, RunId: "", Причина: ""}.
//
Функция НовыйРезультат()
	Результат = Новый Структура;
	Результат.Вставить("Успех", Ложь);
	Результат.Вставить("RunId", "");
	Результат.Вставить("Причина", "");
	Возврат Результат;
КонецФункции

// Перенести ключи user_answer и approval_id из ДопКонтекста в КонтекстТриггера.
// Используется при возобновлении запуска после ответа оператора (TOOL-19 D9).
//
// Параметры:
//  КонтекстТриггера - Структура - структура триггера (изменяется на месте).
//  ДопКонтекст      - Структура, Неопределено - доп. данные от вызывающего.
//
Процедура ДополнитьКонтекстТриггераИзДопКонтекста(КонтекстТриггера, Знач ДопКонтекст)

	Если ТипЗнч(ДопКонтекст) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ДопКлюч = Неопределено;
	Если ДопКонтекст.Свойство("user_answer", ДопКлюч) Тогда
		КонтекстТриггера.Вставить("user_answer", ДопКлюч);
	КонецЕсли;

	ДопКлюч = Неопределено;
	Если ДопКонтекст.Свойство("approval_id", ДопКлюч) Тогда
		КонтекстТриггера.Вставить("InputApprovalId", ДопКлюч);
	КонецЕсли;

КонецПроцедуры

// TD-02 (итерация 2): перенести признак «без агента» и связанные данные
// (ОверрайдПровайдер, ОверрайдTools) из восстановленного снимка в
// КонтекстТриггера, чтобы ar_RuntimeЦикл.ВыполнитьАгентаВнутр мог собрать
// ДанныеАгентаБезАгента при resume sentinel-запусков без реального
// СправочникСсылка.ar_Агенты (см. ar_Scheduler.СформироватьСостояниеДляSentinel,
// ar_RuntimeЦикл.ДанныеАгентаБезАгента).
//
// Строго аддитивно: если Снимок.state не содержит БезАгента=Истина (обычный
// агентный запуск - ar_RuntimeЦикл.НовоеСостояние этот ключ не заводит),
// КонтекстТриггера.БезАгента/ОверрайдTools не добавляются - поведение живого
// ReAct-цикла не затронуто.
//
// ОверрайдПровайдер восстанавливается независимо от БезАгента (UI-01/6):
// ar_RuntimeЦикл.ВыполнитьАгентаВнутр сохраняет его в Состояние и для
// агентных запусков (ar_Диалог.ОтправитьНаСервере может переопределить
// провайдера конкретного агента на диалог) - без этого оверрайд терялся бы
// при первом же approval-resume.
//
// Ссылочные типы запрещены в StateSnapshot (ar_AuditЗапуски.
// ПроверитьСериализуемость), поэтому ОверрайдПровайдер хранится в снимке как
// навигационная ссылка (строка) и здесь разыменовывается обратно в
// СправочникСсылка.ar_LLMПровайдеры через ar_Утилиты.ОбъектИзНавигационнойСсылки.
//
// Параметры:
//  КонтекстТриггера - Структура - структура триггера (изменяется на месте).
//  Снимок           - Структура, Неопределено - {v, state}, результат
//                     ar_AuditЗапуски.ПрочитатьСнимок.
//
Процедура ДополнитьКонтекстТриггераИзСнимкаБезАгента(КонтекстТриггера, Знач Снимок)

	Если ТипЗнч(Снимок) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Состояние = Неопределено;
	Снимок.Свойство("state", Состояние);
	Если ТипЗнч(Состояние) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ОверрайдПровайдерСтрока = "";
	Состояние.Свойство("ОверрайдПровайдер", ОверрайдПровайдерСтрока);
	Если ТипЗнч(ОверрайдПровайдерСтрока) = Тип("Строка") И Не ПустаяСтрока(ОверрайдПровайдерСтрока) Тогда
		ПровайдерРеф = ar_Утилиты.ОбъектИзНавигационнойСсылки(ОверрайдПровайдерСтрока);
		Если ПровайдерРеф <> Неопределено Тогда
			КонтекстТриггера.Вставить("ОверрайдПровайдер", ПровайдерРеф);
		КонецЕсли;
	КонецЕсли;

	БезАгента = Ложь;
	Если Не Состояние.Свойство("БезАгента", БезАгента) ИЛИ БезАгента <> Истина Тогда
		Возврат;
	КонецЕсли;

	КонтекстТриггера.Вставить("БезАгента", Истина);

	ОверрайдTools = Неопределено;
	Если Состояние.Свойство("ОверрайдTools", ОверрайдTools)
		И ТипЗнч(ОверрайдTools) = Тип("Массив") Тогда
		КонтекстТриггера.Вставить("ОверрайдTools", ОверрайдTools);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
